import type { Problem } from './types';

export const problemLibrary: Problem[] = [
  {
    id: 'web-3',
    title: 'Медленная скорость загрузки страниц',
    category: 'Техническая оптимизация',
    content: 'Страницы сайта загружаются слишком долго, что отрицательно сказывается на пользовательском опыте и рейтинге в поисковых системах. Низкая производительность является основным фактором ухода пользователей и может напрямую влиять на доход и восприятие бренда.',
  },
  {
    id: 'design-1',
    title: 'Устаревшая идентичность бренда',
    category: 'Контентное наполнение',
    content: 'Текущая идентичность бренда и визуальные активы выглядят устаревшими и не отражают ценности компании и не привлекают целевую аудиторию. Необходимо обновить бренд, чтобы модернизировать его восприятие и улучшить позиционирование на рынке.',
  },
  {
    id: 'marketing-1',
    title: 'Неэффективная SEO-стратегия',
    category: 'Поисковая оптимизация',
    content: 'Текущая стратегия поисковой оптимизации не позволяет ранжироваться по целевым ключевым словам, что приводит к низкому органическому трафику. Отсутствует видимость в результатах поиска по терминам, которые имеют решающее значение для привлечения квалифицированных лидов.',
  },
  {
    id: 'marketing-2',
    title: 'Низкое вовлечение в социальных сетях',
    category: 'Поисковая оптимизация',
    content: 'Усилия на платформах социальных сетей не приносят значимого вовлечения и не привлекают трафик на сайт. Возможно, контент-стратегия не находит отклика у целевой аудитории или выбор каналов неверен.',
  },
  {
    id: 'web-1',
    title: 'Низкие коэффициенты конверсии сайта',
    category: 'Юзабилити оптимизация',
    content: 'Текущий дизайн сайта и пользовательский путь не оптимизированы для превращения посетителей в клиентов. Ключевые показатели эффективности показывают высокий показатель отказов на целевых страницах и низкое количество выполненных целевых действий, таких как отправка форм или покупки.',
  },
  {
    id: 'web-2',
    title: 'Плохой мобильный опыт',
    category: 'Юзабилити оптимизация',
    content: 'Сайт не является полностью адаптивным и обеспечивает неоптимальный опыт на мобильных устройствах. Это приводит к разочарованию пользователей и значительному снижению вовлеченности мобильного трафика, который составляет растущую долю вашей аудитории.',
  },
  {
    id: 'seo-1',
    title: 'На сайте мало страниц для продвижения',
    category: 'Контентное наполнение',
    content: `Проблема: Сайту не хватает коммерческих страниц для привлечения клиентов.

Проще говоря, ваш сайт предлагает потенциальным клиентам слишком мало «дверей», через которые они могут зайти на сайт и поиска. Чем больше у вас страниц с полезной информацией о товарах/услугах и проектах, тем выше шансы, что вас найдут в поиске те, кому интересно ваше предложение.

Сравнение с конкурентами:

Сейчас ваш сайт проигрывает в объемах контента. Для успешной конкуренции важно увеличить количество страниц.

Ваш сайт: проиндексировано 91 страница.
[скрин]

Конкуренты: 
Конкурент 1 - кол-во страниц
[скрин]
Конкурент 2 - кол-во страниц
[скрин]
Конкурент 3 - кол-во страниц
[скрин]

Наши рекомендации:

Создать недостающие страницы. Мы добавим на сайт все ваши услуги/товары и готовые проекты, которые сейчас отсутствуют. Каждой позиции — своя страница с подробным описанием.
Расширить существующие разделы. Мы добавим больше информации в уже имеющиеся категории, разобьем их на подразделы, как это реализовано у конкурентов. Это не только увеличит количество страниц, но и сделает сайт полезнее для посетителей.

Итог: 
Эти шаги помогут значительно увеличить видимость сайта в поисковых системах и начать уверенно конкурировать за внимание клиентов.`,
  },
  {
    id: 'content-2',
    title: 'Присутствуют не все блоки',
    category: 'Контентное наполнение',
    content: `Проблема: Страница не отвечает на все вопросы посетителей, поэтому не может попасть в ТОП-10.

Поисковые системы (Яндекс и Google) ценят страницы, которые максимально полно раскрывают тему и дают исчерпывающий ответ пользователю. Сейчас ваша страница не содержит ключевых блоков информации, которые ищут люди, рассматривающие подобную процедуру. Из-за этого она проигрывает более подробным сайтам конкурентов.

Рассмотрим типовую страницу вашего сайта на примере страницы {адрес страницы}
скрин блока 1
скрин блока 2
скрин блока n

Какая ещё информация важна для ваших клиентов?

Чтобы страница стала лидером, мы рекомендуем добавить разделы, которые отвечают на самые частые и важные вопросы. 
Пример конкурента {ссылка на страницу конкурента}:
скрин блока 1
скрин блока 2
скрин блока n

Пример конкурента {ссылка на страницу конкурента}:
скрин блока 1
скрин блока 2
скрин блока n

Наши рекомендации:
Детально проанализировать конкурентов из топа поиска, составить список важны продвижения и конверсии контентных блоков, оптимально интегрировать рекомендуемые блоки на страницы продвигаемого сайта.

Итог: Такая комплексная работа превратит вашу страницу в полноценного помощника для клиента и даст ей все шансы занять высокие позиции в поиске.`,
  }
];
